/* 文件名: name.h
 * 描述: 轮询 SPI 的公共接口
 *
 * 边界:
 * 1. 该头文件仅供 bsp 层对应的 bsp 外设驱动源码使用。
 * 2. 它只描述" SPI 端口, 模式, 位序, 速度, 基础收发"
 */

/* 头文件防护
 * **************************************************************/
#ifndef NAME_H
#define NAME_H

#ifdef __cplusplus
extern "C" {
#endif
/* Public includes
 * **************************************************************/
/* 可以根据需要在此处包含必要的库或其他头文件 */
/* #include "some_other_header.h" */

/* Public macros
 * **************************************************************/
/* 对引用文件暴露的宏定义 */

/* Public typedefs
 * **************************************************************/
/* 对引用文件暴露的类型 */
// typedef enum {
// } name_t;

// typedef struct {
// } name_t;

/* Public variables
 * **************************************************************/
/* 对引用文件暴露的变量 */

/* Public function declarations
 * **************************************************************/
/* 对外提供的API接口声明 */

/* 头文件结束
 * **************************************************************/
#ifdef __cplusplus
}
#endif
#endif /* NAME_H */
